/**
 * Created by igorgo on 06.07.2017.
 */
const strings = {
    procClass : 'Обработка класса',
    done : ' …готово!',
    classInfo: '… получение информации о классе',
    classDef: '… получение описания класса',
    clNotFnd: 'Класс не найден',
    metaDomains: '… получение списка доменов метаданных',
    condDomains: '… получение списка доменов форм отбора',
    tabDef: '… получение описания таблицы',
    attrMeta: '… получение метаданных атрибутов',
    consMeta: '… получение метаданных ограничений',
    linkMeta: '… получение метаданных связей',
    viewMeta: '… получение метаданных представлений',
    metMeta: '… получение метаданных методов',
    shMetMeta: '… получение метаданных методов вызова',
    actMeta: '… получение метаданных действий',
    objMeta: '… получение метаданных объектов'
}

module.exports = strings