/**
 * Created by igorgo on 06.07.2017.
 */
const strings = {
    procClass : 'Обробка класу',
    done : ' …готово!',
    classInfo: '… отримання інформації про клас',
    classDef: '… отримання опису класу',
    clNotFnd: 'Клас не знайдено',
    metaDomains: '… отримання списку доменів метаданих',
    condDomains: '… отримання списку доменів форм відбору',
    tabDef: '… получение описания таблицы',
    attrMeta: '… отримання метаданих атрибутів',
    consMeta: '… отримання метаданих обмежень',
    linkMeta: '… отримання метаданих зв\'язків',
    viewMeta: '… отримання метаданих представлень',
    metMeta:  '… отримання метаданих методів',
    shMetMeta:'… отримання метаданих методів виклику',
    actMeta:  '… отримання метаданих дій',
    objMeta:  '… отримання метаданих об\'єктів'
}

module.exports = strings